---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerTypeInvalid
source: html/83dffa17-a810-b1a1-927b-fd18a76aca5a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerTypeInvalid Property

This coupler type does not fit on the selected bar(s). Post error to delete the coupler.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouplerTypeInvalid { get; }
```